fix: 다이어그램 수정
